InformationRegisters/ГрупповыеУпаковкиИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ГрупповыеУпаковкиИСМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Comment>Количество единиц в групповой упаковке</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ГрупповыеУпаковкиИСМП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает известные коэффициенты для групповых упаковок
// 
// Параметры:
//  Номенклатура - Массив Из ОпределяемыйТип.Номенклатура - номенклатура упаковок
// Возвращаемое значение:
//  Соответствие - коэффициенты групповых упаковок (ключ - номенклатура, значение - коэффициент)
Функция КоэффициентыГрупповыхУпаковок(Знач Номенклатура) Экспорт
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.текст = 
	"ВЫБРАТЬ
	|	ГрупповыеУпаковкиИСМП.Номенклатура КАК Номенклатура,
	|	ГрупповыеУпаковкиИСМП.Коэффициент  КАК Коэффициент
	|ИЗ
	|	РегистрСведений.ГрупповыеУпаковкиИСМП КАК ГрупповыеУпаковкиИСМП
	|ГДЕ
	|	ГрупповыеУпаковкиИСМП.Номенклатура В (&Номенклатура)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Результат.Вставить(Выборка.Номенклатура, Выборка.Коэффициент);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура СохранитьКоэффициентУпаковки(Знач Номенклатура, Знач Коэффициент) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.ГрупповыеУпаковкиИСМП.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Номенклатура = Номенклатура;
	МенеджерЗаписи.Коэффициент = Коэффициент;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
